Revit 2022 API
UnitUtils.IsValidUnit Method
 Checks whether a unit is valid for a given spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Syntax
C#
public static bool IsValidUnit(
	ForgeTypeId specTypeId,
	ForgeTypeId unitTypeId
)
Visual Basic
Public Shared Function IsValidUnit ( _
	specTypeId As ForgeTypeId, _
	unitTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsValidUnit(
	ForgeTypeId^ specTypeId,
	ForgeTypeId^ unitTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the spec.
unitTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the unit to check.
Return Value
 True if the unit is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace